/**
 * @example
 *
 * ```js
    // Database-MySQL-什么是 SQL
    // - 1、什么是 SQL
    // - - SQL（英文全称：Structured Query Language）是结构化查询语言，专门用来访问和处理数据库的编程语言。我们以编程的形式，操作数据库里面的数据。
    // - - 三个关键点：
    // - - - SQL 是一门数据库编程语言
    // - - - 使用 SQL 语言编写出来的代码，叫做 SQL 语句
    // - - - SQL 语句只能在关系型数据库中使用（例如 MySQL、Oracle、SQL Server）。非关系型数据库（例如 MongoDB）不支持 SQL 语言

    // - 2、SQL 能做什么
    // - - 1）从数据库中查询数据
    // - - 2）向数据库中插入新数据
    // - - 3）更新数据库中的数据
    // - - 4）从数据库删除数据
    // - - 5）可以创建新数据库
    // - - 6）可在数据库中创建新表
    // - - 7）可在数据库中创建存储过程、视图
    // - - 8）etc...

    // - 3、SQL 的学习目标
    // - - 重点掌握如何使用 SQL 从数据表中：查询数据（select）、插入数据（insert into）、更新数据（update）、删除数据（delete）
    // - - 额外需要掌握 4 中 SQL 语法：
    // - - where 条件、and 和 or 运算符、order by 排序、count(*) 函数
 * ```
 *
 */