/**
 * @example
 *
 * ```js
    // Project-Session 原理
    // - 1、HTTP 协议的无状态性
    // - - 了解 HTTP 协议的无状态性是进一步学习 Seesion 认证机制的必要前提
    // - - HTTP 协议的无状态性，指的是客户端的每次 HTTP 请求都是独立的，连续多个请求之间没有直接的关系，服务器不会主动保留每次 HTTP 请求的状态
    // - - 现实例子：客户 1、客户 2、客户 3、客户 4、客户 5、客户 N | 超市收银员；超市收银员能记住当前的客户是否为 VIP 会员吗？？

    // - 2、如何突破 HTTP 无状态限制
    // - - 对于超市来说，为了方便收银员在进行结算时给 VIP 用户打折，超市可以为每个 VIP 用户发放会员卡。
    // - - 注意：现实生活中的会员卡身份认证，在 Web 开发中的专业术语叫做 Cookie。

    // - 3、什么是 Cookie
    // - - Cookie 是存储在用户浏览器中的一段不超过 4KB 的字符串。它是一个名称（Name）、一个值（Value）和其它几个用于控制 Cookie 有效期、安全性、使用范围的可选属性组成。
    // - - 不同域名下的 Cookie 各自独立，每当客户端发起请求时，会自动把当前域名下所有未过期的 Cookie 一同发送到服务器。
    // - - Cookie 的几大特性：
    // - - - 1）自动发送
    // - - - 2）域名独立
    // - - - 3）过期时限
    // - - - 4）4KB 限制

    // - 4、Cookie 在身份认证中的作用
    // - - 客户端第一次请求服务器的时候，服务器通过响应头的形式，向客户端发送一个身份认证的 Cookie，客户端会自动将 Cookie 保存在浏览器中。
    // - - 随后，当客户端浏览器每次请求服务器的时候，浏览器会自动将身份认证相关的 Cookie，通过请求体的形式发送给服务器，服务器既可验证客户端的身份

    // - 5、Cookie 不具有安全性
    // - - 由于 Cookie 是存储在浏览器中的，而且浏览器也提供了读写 Cookie 的 API，因此 Cookie 很容易被伪造，不具有安全性。因此不建议服务器将如此重要的隐私数据，通过 Cookie 的形式发送给浏览器。
    // - - 注意：千万不要使用 Cookie 存储重要且隐私的数据！比如用户的身份信息、密码登。

    // - 6、提供身份认证的安全性
    // - - 为了防止客户伪造会员卡，收银员在拿到客户出示的会员卡之后，可以在收银机上进行刷卡认证。只有收银机确认存在的会员卡，才能被正常使用。
    // - - 这种“会员卡+刷卡认证” 的设计理念，就是 Session 认证机制的精髓。

    // - 7、Session 的工作原理
    // - - 浏览器（Client）-客户端登录：提交账号与密码-> 
    // - - 服务器（Server）（验证账号和密码）（将登录成功后的用户信息存储在服务器内存中，同时生成对应的 Cookie 字符串）-服务器响应：将生成的 Cookie 响应给客户端->
    // - - 浏览器（Client）（浏览器自动把 Cookie 存储在当前域名下）-客户端再次发起请求时，通过请求头自动把当前域名下所有可用的 Cookie 发送给服务器-> 
    // - - 服务器（Server）（服务器根据请求头中携带的 Cookie，从内存中查找对应的用户信息）（用户的身份认证成功后，服务器针对当前用户生成特定的响应内容）-服务器响应：把当前用户对应的页面内容响应给浏览器-> 
    // - - 浏览器（Client）

 * ```
 *
 */